# ============================================
# Essential packages (both personal and work)
# ============================================
tap "felixkratz/formulae"
tap "nikitabobko/tap"

# Core dev tools
brew "git"
brew "gh"
brew "neovim"
brew "tmux"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "lazygit"
brew "git-delta"
brew "difftastic"
brew "starship"
brew "yazi"
brew "zoxide"
brew "lsd"

# Languages & tools
brew "node"
brew "python@3.13"
brew "lua-language-server"
brew "luarocks"

# Zsh plugins
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"

# Window manager & status bar
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"

# Essential casks
cask "nikitabobko/tap/aerospace"
cask "wezterm"
cask "docker-desktop"
cask "font-hack-nerd-font"
cask "git-credential-manager"
cask "claude-code"

{{- if eq .machineType "personal" }}
# ============================================
# Personal machine packages
# ============================================
tap "azure/functions"
tap "caarlos0/tap"
tap "databricks/tap"
tap "snowflakedb/snowflake-cli"
tap "teamookla/speedtest"

brew "openssl@3"
brew "aerc"
brew "aicommits"
brew "atuin"
brew "azure-cli"
brew "bdw-gc"
brew "cmus"
brew "dua-cli"
brew "exiftool"
brew "fastapi"
brew "ffmpeg"
brew "gcc"
brew "pkgconf"
brew "gedit"
brew "gemini-cli"
brew "glances"
brew "htop"
brew "hurl"
brew "ifstat"
brew "iftop"
brew "imagemagick"
brew "imlib2"
brew "ipython"
brew "kew"
brew "lazysql"
brew "lynx"
brew "make"
brew "mods"
brew "mpv"
brew "neofetch"
brew "neomutt"
brew "nload"
brew "ollama"
brew "pandoc"
brew "pipx"
brew "poetry"
brew "poppler"
brew "protobuf"
brew "pyenv"
brew "python@3.12"
brew "rbenv"
brew "rmlint"
brew "ruby"
brew "ruff"
brew "rust"
brew "sevenzip"
brew "snowflake-cli"
brew "speedtest-cli", link: false
brew "spicetify-cli"
brew "spotify_player"
brew "spotifyd", restart_service: :changed
brew "stow"
brew "unixodbc"
brew "unzip"
brew "uv"
brew "w3m"
brew "yarn"
brew "azure/functions/azure-functions-core-tools@4"
brew "databricks/tap/databricks"
brew "teamookla/speedtest/speedtest"

cask "darktable"
cask "digikam"
cask "gitkraken"
cask "hammerspoon"
cask "obsidian"
cask "postman"
cask "qbittorrent"
cask "signal"
cask "snowflake-snowsql"
cask "visual-studio-code"

vscode "azurite.azurite"
vscode "charliermarsh.ruff"
vscode "cschlosser.doxdocgen"
vscode "databricks.databricks"
vscode "docker.docker"
vscode "ecmel.vscode-html-css"
vscode "enkia.tokyo-night"
vscode "fabiospampinato.vscode-diff"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "grapecity.gc-excelviewer"
vscode "jonathan-yeung.mark-sharp"
vscode "mechatroner.rainbow-csv"
vscode "meezilla.json"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "saoudrizwan.claude-dev"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "vintharas.learn-vim"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
{{- end }}

{{- if eq .machineType "work" }}
# ============================================
# Work machine packages (minimal extras)
# ============================================
# Add any work-specific tools here if needed
{{- end }}
